//1.1 

//$x = 5;
//$y = 7;
//echo $sum = $x + $y.' ';
//echo $ym = $x * $y;
//?>
//===============================================//

//1.2

//$x = 4;
//$y = 6;
//$la = $x * $x;
//$ly = $y * $y;
//echo $sum = $la + $ly;
//?>
//==============================================//

//1.3

//$x = readline();
//$y = readline();
//$z = readline();
//$sum = $x + $y + $z;
//echo $tt = $sum / 3;
//?>
//=============================================//

//1.4

//$x = readline();
//$y = readline();
//$z = readline();
//$li1 = $x * $x;
//$li2 = $y * $y;
//$ym= 4 * ($x + 1);
//$ym1 = 2 * ($z - 2 * $li1 + $li2);
//echo $po = $ym - $ym1;
//?>
//===========================================//

//1.5

//$a = readline();
//$b = readline();
//$c = readline();
//echo $s1 = ($a + $b) / $c </br>;
//echo $s2 = ($a + $c) / $b </br>;
//echo $s3 = ($b + $c) / $a </br>;
//?>
//==========================================//

//1.6

//$a = readline();
//$d = $a % 10 ;
//$c = ($a % 100 - $d) / 10;
//$l = ($a % 1000 - $a % 100) / 100;
//echo $g = $d + $c + $l;
//?>
//========================================//

//2.1

//$a = readline();
//if ($a > 10)
//{
//	echo $k = $a + 100;
//}
//else 
//{
//	echo $l = $a - 30;
//}
//?>
//=======================================//
2.2

$a = 8;
if ($a % 2 == 0)
{
	echo $j = $a / 2;
}
else 
{
	echo $o = $a * 3;
}
?>

2.3

$a = readline();
if ($a => 50)
{
	echo $a = $a * $a;
}
elseif ($a > 10 && $a < 30)
{
	echo "0";
}
else
{
	echo "Error";
}
?>

2.4

$a = 15;
$b = 4;
if ($a > $b)
{
	echo $a;
}
else
{
	echo $b;
}
?>





2.5

$a = 19;
$b = 143;
$c = $b- $a;
$d = $a - $b;
if ($c => 100 or $d => 100)
{
	echo "Yes";
}
else
{
	echo "No";
}
?>

2.6

$a = readline();
$b = readline();
$c = $b- $a;
$d = $a - $b;
if ($c > 0 && $d > 0)
{
	if ($c < 20 || $d < 20)
	{
		echo "Yes";
	}
	else
	{
		echo "No";
	}
}
?>

2.7

$a = readline();
if ($a[0]>=$a[1] && $a[0]>=$a[2] && $a[1]>=$a[2]) 
{
    echo $a[0].$a[1].$a[2];
}
elseif ($a[1]>=$a[0] && $a[1]>=$a[2] && $a[0]>=$a[2]) 
{
    echo $a[1].$a[0].$a[2];
}
elseif ($a[2]>=$a[0] && $a[2]>=$a[1] && $a[0]>=$a[1]) 
{
    echo $a[2].$a[0].$a[1];
}
elseif ($a[2]>=$a[0] && $a[2]>=$a[1] && $a[1]>=$a[0]) 
{
    echo $a[2].$a[1].$a[0];
}
?>

2.8

$a = readline();
if ($a == "1")
{
	echo "Понедельник";
}
elseif ($a == "2")
{
	echo "Вторник";
}
elseif ($a == "3")
{
	echo "Среда";
}
elseif ($a == "4")
{
	echo "Четверг";
}
elseif ($a == "5")
{
	echo "Пятница";
}
elseif ($a == "6")
{
	echo "Суббота";
}
elseif ($a == "7")
{
	echo "Воскресение";
}
?>

2.9

$a = readline();
if ($a >= 80)
{
	echo "Здравствуйте, уважаемый";
}
else
{
	echo "Успехов!";
}
?>

3.1

$arr = array("Привет", ",","мир", "!");
echo $arr[0].$arr[1]." ".$arr[2].$arr[3];
?>

3.2

$arr = array("Привет", ",","мир", "!");
$text = $arr[0].$arr[1]." ".$arr[2].$arr[3];
echo $text;
?>

3.3

$arr = array("Привет", ",","мир", "!");
$arr[0] = "Пока";
echo $arr = $arr[0].$arr[1]." ".$arr[2].$arr[3];
?>

3.4

$arr = array("1", " ","2", ",", "3");
foreach ($arr as $arr2)
 {
  if($arr == " " or $arr == ",")
  { 
  	continue;
  }
  else 
  {
  	echo $arr2;
  }
 }
?>

3.5

$arr=("Коля"=>"1000", "Вася"=>"500", "Петя"=>"200")
echo $arr['Коля'];
?>

//3.6

//$arr = [1, 2, 3, 4, 5];

//$arr2[] = 1;
//$arr2[] = 2;
//$arr2[] = 3;
//$arr2[] = 4;
//
//echo implode(", ", $arr)."
//";
//echo implode(", ", $arr2);

//========================================================//

//3.7

//$arr = array("a"=>"1", "b" => "2", "c" => "3");
//echo $arr['b'];

//========================================================//

//3.8

//$arr = ['a'=>1, 'b'=>2, 'c'=>3];
//$sum = 0;

//foreach($arr as $key)
//{
//$sum += $key;
//}
//echo $sum;

//========================================================//

//3.9

//$arr = ['1'=> 'понедельник', '2'=> 'вторник', '3'=>'среда', '4'=>'четверг', '5'=>'пятница', '6'=>'суббота', '7'=>'воскресенье'];
//echo $arr['4'];

//========================================================//

//3.10

//$arr = ['1'=> 'понедельник', '2'=> 'вторник', '3'=>'среда', '4'=>'четверг', '5'=>'пятница', '6'=>'суббота', '7'=>'воскресенье'];
//$day = $arr['3'];
//echo $day;

//========================================================//

//4.1

//$arr = [
//'sp'=>['azul', 'rojo', 'verde'],
//'en'=>['blue', 'red', 'green']];
//echo $arr['sp'][0];

//========================================================//

//4.2

//$arr=['a', 'b', 'c'];
//var_dump($arr);

//$arr2 = [
//'sp'=>['azul', 'rojo', 'verde'], 'en'=>['blue', 'red', 'green']];

//echo "
//".$arr2['sp'][0]."";
//echo $arr2['sp'][1]."";
//echo $arr2['sp'][2]."";

//========================================================//

//4.3

//$mas = array(2,8,5,3);
//$a = $mas[0]*$mas[1]+$mas[2]*$mas[3];
//echo "$mas[0]*$mas[1]+$mas[2]*$mas[3] = ".$a;

//========================================================//

//4.4

//for($i=0;$i<5;$i++)
//{
//$arr[$i] = $i+1;
//}

//echo implode(", ",$arr);

//========================================================//

//4.5

//$arr = [
//'cms'=>['joomla', 'wordpress', 'drupal'],
//'colors'=>['blue'=>'голубой', 'red'=>'красный', 'green'=>'зеленый']];
//echo $arr['cms'][0]."";
//echo $arr['cms'][2]."";
//rojo
//echo $arr['cms'][1][2].$arr['cms'][1][1].$arr['cms'][0][0].$arr['cms'][0][1];

//========================================================//

//4.6

//$arr = [
//'ru'=>[1=> 'понедельник', 2=> 'вторник', 3=>'среда', 4=>'четверг', 5=>'пятница', 6=>'суббота', 7=>'воскресенье'],
//'en'=>[1=> 'monday', 2=> 'tuesday', 3=>'wednesday', 4=>'thursday', 5=>'friday', 6=>'saturday', 7=>'sunday']];
//echo $arr['ru'][1]."";
//echo $arr['en'][3];

//========================================================//

//4.7

//$arr = [
//'ru'=>[1=> 'понедельник', 2=> 'вторник', 3=>'среда', 4=>'четверг', 5=>'пятница', 6=>'суббота', 7=>'воскресенье'],
//'en'=>[1=> 'monday', 2=> 'tuesday', 3=>'wednesday', 4=>'thursday', 5=>'friday', 6=>'saturday', 7=>'sunday']];
//$lang = 'ru';
//$day = 3;
//echo $arr[$lang][$day];
?>


//7.1
//$a = "php";
//$a = strtoupper($a);
//echo $a;
//============================================//

//7.2
//$a = "PHP";
//$a = strtolower($a);
//echo $a;
//============================================//

//7.3
//$a = "london";
//$a = ucfirst($a);
//echo $a;
//============================================//

//7.4
//$a = "London";
//$a = lcfirst($a);
//echo $a;
//==============================================//

//7.5
//$a = "london is the capital of great britan";
//$a = ucwords($a);
//echo $a;
//==============================================//

//7.6
//$a = "LONDON";
//$a = strtolower($a);
//$a = ucfirst($a)
//echo $a;
//=============================================//

//7.7
//$a = "html css php";
//$a = strlen($a);
//echo $a;
//============================================//

//7.8
//$passowrd = "10690";
//if(strlen($passowrd)>5 && strlen($password)<10)
//{
    //echo "Пароль подходит"; 
//}
//else
//{
    //echo "Придумайте новый пароль!";
//}
//=========================================//


// 7.9
//$str = "html css php";
//$str = substr($str, 0,4);
//$str = substr($str, 5,3); 
//$str = substr($str, 9);
//echo $str;

//========================================================// 

//e7.10
//$a = "qwertyuiop"; 
//$a = substr($a, strlen($str)-3);
//echo $a;

//========================================================//
 
//e7.11
//$a = "http://qwertyuiop.com";
//echo $a;
//if (substr($a, 0,7) == "http://")
//{
    //echo "Да";
//}
    //else
//{
     //echo "Нет";
//}
    

//========================================================//
 
//7.12
//$a = "https://qwertyuiop.com";
//echo "$a <br>";
//if (substr($a, 0,7) == "http://" || substr($a, 0,8) == "https://")
//{
    //echo "Да";
//}
    //else
//{
    //echo "Нет";
//}

//========================================================//
 
//7.13
//$a = "qwerty.png";
//echo "$a <br>";
//if (substr($a, strlen($str)-4) == ".png")
//{
    //echo "Да";
//}
    //else
//{
       //echo "Нет";
//}

//========================================================//
 
//7.14
//$a = "qwerty.jpg";
//echo "$a <br>";
//if (substr($a, strlen($a)-4) == ".png" || substr($a, strlen($a)-4) == ".jpg")
//{
        //echo "Да";
//}
    //else
//{
        //echo "Нет";
//}
    
//========================================================//
     
//7.15
//$a = "Lorem ipsum";
//if(strlen($a) > 5)
//{
        //echo substr($a,0,5)."...";
//}
    //else
//{
        //echo $a;
//}

//========================================================//
     
//7.16
//$a = "31.12.2013";
//echo a_replace(".", "-", $a);

//========================================================//
 
//7.17
//$a = "abracadabra";
//echo "$a <br>";
//$p = array("a","b","c");
//$om = array("1","2","3");
//echo str_replace($p,$om,$a);

//========================================================//
 
//7.18
//$a = "1a2b3c4b5d6e7f8g9h0";
//echo "$a <br>";
//$om = array("1","2","3","4","5","6","7","8","9","0");
//echo str_replace($om, "", $a);

//========================================================//
 
//7.19
//$a = "abracadabra";
//echo "$a <br>";
//$skar = array("a"=>"1","b"=>"2","c"=>"3");
//echo "1. ".strtr($a, $skar)."<br>";
//echo "2. ".strtr($a,"abc","123");

//========================================================//
    
//7.21
//$a = "capability";
//echo "$a <br>";
//echo substr_replace($word, "!!!", 2,5);

//========================================================//
 
//7.22
//$a = "abc abc abc";
//echo strpos($a,"b");

//========================================================//
 
//7.23
//$a = "abc abc abc";
//echo strrpos($a,"b");

//========================================================//
     
//7.24
//$a = "abc abc abc";
//echo strpos($a,"b",3);

//========================================================//
     
//7.25
//$a = "aa aa aa aa";
//echo "$a <br>";
//1//echo strpos($a," ",3)."<br>";
//2//$q = 0;
    //for($i=0;$i<strlen($a)-1;$i++)
//{
    //if($str[$i] == "." && $str[$i+1] == ".")
//{
    //echo "Да";
    //$q = 1;
    //break;
//}
//}
    //if ($q == 0)
//{
    //echo "Нет";
//}

//7.26

$x = "http://";
if ($x = "http://")
{
    echo "Да";
}
else
{
    echo "Нет";
}


7.27

$x = "html css php";
$y = explode(" '", $x);
echo $y[0];
echo $y[1];
echo $y[2];


7.28

$x = array("html", "css", "php");
$y = implode(", ", $x);
echo $y;


7.29

$date = "2016-12-31";
$x = explode("-", $date);
echo $x[2]. ".".$x[1]. ".".$x[0];


7.30


$x = "1234567890";
$y = str_split($x, 2);
echo $y[0]. " ".$y[1]. " ".$y[2]. " ".$y[3]. " ".$y[4];


7.31

$x = "1234567890";
$y = str_split($x, 1);
echo $y[0]. " ".$y[1]. " ".$y[2]. " ".$y[3]. " ".$y[4]. " ".$y[5]. " ".$y[6]. " ".$y[7]. " ".$y[8]. " ".$y[9];


7.32

$x = "1234567890";
$y = str_split($x, 2);
$r = implode("-", $y);
echo $r;


7.33

$x = " hello mum ";
echo trim($x);


7.34

$x = "/php/";
echo trim($x, "/");


7.35

$x = "слова слова слова.";
echo trim($x, "."). ".";


7.36

$x = "12345";
echo strrev($x);


7.37

$x = "madam";
$y = strrev($x);
if ($x = $y)
{
    echo "yes";
}
else
{
    echo "no";
}


7.38

$x = "UnaFata";
echo str_shuffle($x);


7.39

$x = "abcdifghijklnmopqrstuvwxyz";
$y = str_shuffle($x);
$z = substr($y, 0, 6);
echo $z;


7.40

$x = "x";
for ($i = 1; $i <10; $i++)
{
    echo "<br>".str_repeat($x, $i);
}


7.41

for ($i = 2; $i <10; $i++)
{
    echo "<br>".str_repeat($i, $i);
}


7.42

$x = "html, <b>php</b>, js";
echo strip_tags($x);


7.44

$x = "<p>html</p>, <b>php</b>, <i>js</i>";
echo strip_tags($x, "<b>, <i>");


7.45

$x = "html, <b>php</b>, js";
echo htmlspecialchars($x);


7.46

$x = "ab-cd-ef";
echo strstr($x, "-");


8.1

$x = "Владикавказ Санкт-Питербург Краснодар Липетск";
$y = explode(" ", $x);
sort($y);
echo $m = implode(", ", $y);


8.2

$x = "var_test_text";
$z = explode("_", $x);
$m = implode(" ", $z);
$y = ucwords($m);
$h = explode(" ", $y);
$h = implode("", $h);
echo $t = lcfirst($h);


8.3

$x = "12345 67890";
$z = explode(" ", $x);
$z[0] = strrev($z[0]);
$z[1] = strrev($z[1]);
echo implode(" ", $z);


8.4
????
8.5
$
$arr = [367, 2, 3, 10];
$x = implode(",", $arr);
echo substr_count($x, 3);


8.6

$x = "12345678";
$y = str_split($x, 2);
echo array_sum($y);


8.7
????